# математические операторы
a = 500
b = 200
print(a, type(a))

# summa
print('a + b =', a + b)
print(a + 100)

# вычитание
print('a - b =', a - b)

# умножение
print('a * b =', a * b)

print('a / b =', a / b)  # при делении всегда возвращает float
print('a // b', a // b)  # оставляет только целую часть числа
# возведение в степень
print('a ** 2 =', a ** 2)  # a - число, 2 - степень
print('25 ** 0.5 =', 25 ** 0.5)  # корень из числа (корень из 2)
# получение остатка
print('a % b =', a % b)
#
print('целая часть от a деленного на b =', a // b)
print('остаток от а деленного на b =', a % b)
 # x = 'Hello Word'
 # w = 'Word'
 #
 # print(x - 'Word')